Data/TU_Delft_Campus_case/c_1_1/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (0 4.97 0);
pressure             0;
turbulentKE          0.8953;
turbulentEpsilon     0.03328;

// ************************************************************************* //
