Data/TU_Delft_Campus_case/c_1_1/system/cuttingPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

cuttingPlane
{
    type            surfaces;
    libs            ("libsampling.so");

    writeControl    writeTime;

    surfaceFormat   vtk;
    fields          (U k p);

    interpolationScheme cellPoint;

    surfaces
    (
        zNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 3.7); //1.95 (lower height) + 1.75 (pedestrian height)
                normal  (0 0 1);
            }
            interpolate     true;
        }

        xNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (-30 373 0); //plane along the acceleration passage next to EWI building
                normal  (1 0 0);
            }
            interpolate     true;
        }
    );
}


// ************************************************************************* //
